---
kind: type
id: T:Autodesk.Revit.DB.RoutingPreferenceRuleGroupType
source: html/79896fd9-e90c-6561-3bc4-7cefd4692ae5.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRuleGroupType

Add more rule group type here.

## Syntax (C#)
```csharp
public enum RoutingPreferenceRuleGroupType
```